Revit 2027 API
SpecTypeId.SectionDimension Property
 Section Dimension, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SectionDimension { get; }
Public Shared ReadOnly Property SectionDimension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SectionDimension {
	ForgeTypeId^ get ();
}
static member SectionDimension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace